tutorials/reactingQGDFoam/2D/gasBubble/bubbleHe/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiQGDThermo;
    mixture         reactingMixture;
    transport       const;
    thermo          eConst;
    energy          sensibleInternalEnergy;
    equationOfState perfectGas;
    specie          specie;
}

inertSpecie N2;

chemistryReader foamChemistryReader;

foamChemistryFile "$FOAM_CASE/constant/reactions";

foamChemistryThermoFile "$FOAM_CASE/constant/thermo.compressibleGas";

QGD
{
    pRefCell       0;
    pRefValue      1e5;

    implicitDiffusion  true;
    QGDCoeffs constScPrModel1;
//    QGDCoeffs varScModel7;
//    varScModel7Dict
    constScPrModel1Dict
    {
        cSc1  0;
        ScQGD 0.1;
        PrQGD 1;
    }
    
}


// ************************************************************************* //
